app/Controllers/Notes.php

    public function index()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to(base_url('auth/login'));
        }

        $data = [
            'title' => 'Notlarım',
            'notes' => $this->noteModel->select('notes.*, categories.name as category_name')
                                    ->join('categories', 'categories.id = notes.category_id', 'left')
                                    ->where('notes.user_id', $this->session->get('id'))
                                    ->findAll()
---
SELECT `notes`.*, `categories`.`name` as `category_name`
FROM `notes`
LEFT JOIN `categories` ON `categories`.`id` = `notes`.`category_id`
WHERE `notes`.`user_id` = '12'

                ];

                try {
                    $this->noteModel->insert($data);
---
INSERT INTO `notes` (`user_id`, `category_id`, `title`, `content`, `is_private`, `created_at`, `updated_at`) VALUES ('12', '2', 'aabbcc', 'sfafdfsdvdfbdfbdfbdfbdfbfdb', 0, '2024-12-28 09:42:50', '2024-12-28 09:42:50')

            }
        }

        $data['categories'] = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function edit($id)
    {
        $note = $this->noteModel->find($id);
---
SELECT *
FROM `notes`
WHERE `notes`.`id` = '12'

        }

        $data['note'] = $note;
        $data['categories'] = $this->categoryModel->findAll();
---
SELECT *
FROM `categories`

    public function addComment()
    {
        if (!$this->session->get('isLoggedIn')) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Lütfen önce giriş yapın'
            ])->setStatusCode(401);
        }

        try {
            $noteId = $this->request->getPost('note_id');
            $comment = $this->request->getPost('comment');

            // Note ID'nin geçerli olduğunu kontrol et
            $note = $this->noteModel->find($noteId);
---
SELECT *
FROM `notes`
WHERE `notes`.`id` = '12'